# Pandas for Beginners

## What is Pandas?

* Pandas is an open-source Python package that is most widely used for data science/data analysis and machine learning tasks.
* Pandas is a Python library used for working with datasets.
* It has functions for analyzing, cleaning, exploring, and manipulating data.

## Why use Pandas?

* Pandas allows us to analyze big data and make conclusions based on statistical theories.
* Pandas can clean messy datasets, and make them readable and relevant.
* Having relevant data is very important when working with data science projects.

## Loading data into Pandas

In this tutorial, we will work with the **BlackFriday dataset** which is a comma-separated values (CSV) file type.

In [1]:
import os
import pandas as pd
import numpy as np

In [2]:
BASE_DIR = os.path.abspath(os.path.join(os.path.dirname( "__file__" ), '..'))
DATA_PATH = os.path.join(BASE_DIR, "data","BlackFriday_train.csv")

In [3]:
df = pd.read_csv(DATA_PATH) # Read csv file

In [4]:
df

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,B,1,1,20,NaN,NaN,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,NaN,NaN,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,NaN,NaN,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,NaN,NaN,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,NaN,NaN,490

In [5]:
# check the type of df

type(df)

pandas.core.frame.DataFrame

In [6]:
# check shape of dataframe

df.shape

(550068, 12)

In [7]:
# view the first five rows of the dataframe

df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [8]:
# view the first last rows of the dataframe

df.tail()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
550063,1006033,P00372445,M,51-55,13,B,1,1,20,NaN,NaN,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,NaN,NaN,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,NaN,NaN,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,NaN,NaN,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,NaN,NaN,490

In [9]:
# view concise summary of dataframe

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   Gender                      550068 non-null  object
 3   Age                         550068 non-null  object
 4   Occupation                  550068 non-null  int64
 5   City_Category               550068 non-null  object
 6   Stay_In_Current_City_Years  550068 non-null  object
 7   Marital_Status              550068 non-null  int64
 8   Product_Category_1          550068 non-null  int64
 9   Product_Category_2          376430 non-null  float64
 10  Product_Category_3          166821 non-null  float64
 11  Purchase                    550068 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 50.4+ MB

## Handling Missing Values

In [10]:
# Check the total number of missing values in each column in the dataset

df.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
dtype: int64

We can see that there are 166986 missing values in Product_Category_2 and 373299 columns in Product_Category_3 columns.

### isna() and notna() functions to detect 'NA' values

Pandas provides isna() and notna() functions to detect 'NA' values.

These are also methods on Series and DataFrame objects.

To detect ‘NA’ values in the dataframe:

df.isna().sum()

To detect ‘NA’ values in a particular column in the dataframe:

pd.isna(df[‘col_name’])

df[‘col_name’].notna()

In [11]:
df.isna().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
dtype: int64

### Handle missing numerical values

There are several methods to handle missing values. Each method has its own advantages and disadvantages. The choice of the method is subjective and depends on the nature of data and the missing values. In this section, I have listed the most commonly used methods to deal with missing values. They are as follows:-

* Drop missing values with dropna() method

* Fill missing values with zeros

* Fill missing values with a test statistic

* Fill missing values backward or forward

In this section, I have filled the missing values with forward or backward filling.

The **pad** or **fill** option fill values forward, while **bfill** or **backfill** option fill values backward.

In [12]:
df = df.fillna(method = 'pad')

Again, we should check whether missing values are removed or not.

In [13]:
df.isnull().sum()

User_ID                       0
Product_ID                    0
Gender                        0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category_1            0
Product_Category_2            1
Product_Category_3            1
Purchase                      0
dtype: int64

We can see that the Product_Category_2 and Product_Category_3 have 1 missing value. We can use the head() to check this.

In [14]:
df[['Product_Category_2', 'Product_Category_3']].head()

   Product_Category_2  Product_Category_3
0                 NaN                 NaN
1                 6.0                14.0
2                 6.0                14.0
3                14.0                14.0
4                14.0                14.0

We can see that the first element of each column are NaN. So, in this case pad or fill option does not work. Here, we should use **bfill** or **backfill** options as follows:-

In [15]:
df = df.fillna(method = 'backfill')

Again, we should check whether missing values are filled or not.

In [16]:
df.isnull().sum()

User_ID                       0
Product_ID                    0
Gender                        0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category_1            0
Product_Category_2            0
Product_Category_3            0
Purchase                      0
dtype: int64

### Check with ASSERT statement

Finally, we should check for missing values programmatically. If we drop or fill missing values, we expect no missing values. We can write an assert statement to verify this. So, we can use an assert statement to programmatically check that no missing or unexpected '0' value is present. This gives confidence that our code is running properly.

Assert statement will return nothing if the value being tested is true and will throw an AssertionError if the value is false.

Asserts

• assert 1 == 1 (return Nothing if the value is True)

• assert 1 == 2 (return AssertionError if the value is False)

In [17]:
# Assert that there are no missing values in the dataframe

assert pd.notnull(df).all().all()

## Indexing and Slicing

In this section, we will discuss how to slice and dice the data and get the subset of pandas dataframe.

Pandas provides two types of Multi-axes indexing. Those two types are mentioned in the following table:-

* **.loc** - Label based
* **.iloc** - Integer based

#### Label based indexing using .loc indexer

Pandas provide .loc indexer to have purely label based indexing. When slicing, the start bound is also included. Integers are valid labels, but they refer to the label and not the position.

.loc indexer has multiple access methods like −

* A single scalar label

* A list of labels

* A slice object

* A Boolean array

**Syntax**

.loc takes two single/list/range operator separated by comma (,).

The first one indicates the **row** and the second one indicates **columns**.

Below are the examples of selecting data using .loc indexer:-

In [18]:
# Make a copy of dataframe

df1 = df.copy()

In [19]:
# Select first row of dataframe

df1.loc[0]

User_ID                         1000001
Product_ID                    P00069042
Gender                                F
Age                                0-17
Occupation                           10
City_Category                         A
Stay_In_Current_City_Years            2
Marital_Status                        0
Product_Category_1                    3
Product_Category_2                    6
Product_Category_3                   14
Purchase                           8370
Name: 0, dtype: object

In [20]:
# Select first five rows for a specific column

df1.loc[:,'Purchase'].head()

0     8370
1    15200
2     1422
3     1057
4     7969
Name: Purchase, dtype: int64

In [21]:
# Select all rows for multiple columns, say list[]

df1.loc[:,['Age','Occupation']]

          Age  Occupation
0        0-17          10
1        0-17          10
2        0-17          10
3        0-17          10
4         55+          16
...       ...         ...
550063  51-55          13
550064  26-35           1
550065  26-35          15
550066    55+           1
550067  46-50           0

[550068 rows x 2 columns]

In [22]:
# Select first five rows for multiple columns, say list[]

df1.loc[[0, 1, 2, 3, 4],['Age','Occupation']]

    Age  Occupation
0  0-17          10
1  0-17          10
2  0-17          10
3  0-17          10
4   55+          16

In [23]:
# Select range of rows for all columns

df1.loc[0:4]

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,6.0,14.0,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,6.0,14.0,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,14.0,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,14.0,14.0,7969

In [24]:
# The above functionality can also be given by

df1.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,6.0,14.0,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,6.0,14.0,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,14.0,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,14.0,14.0,7969

### Integer position based indexing using .iloc indexer

Pandas provides **.iloc indexer** for integer position based indexing.

.iloc is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array. .iloc will raise IndexError if a requested indexer is out-of-bounds, except slice indexers which allow out-of-bounds indexing. Allowed inputs of .iloc indexer are:-

* An integer e.g. 5.
* A list or array of integers [4, 3, 0].
* A slice object with ints 1:7.
* A boolean array.

### Rows selection using .iloc indexer

Below are the examples of row selection using .iloc indexer

**select first row of dataframe**: 
df1.iloc[0]

**select second row of dataframe**: 
df1.iloc[1]

**select last row of dataframe**: 
df1.iloc[-1]

**select second last row of dataframe**: 
df1.iloc[-2]

In [25]:
# Select first row of dataframe

df1.iloc[0]

User_ID                         1000001
Product_ID                    P00069042
Gender                                F
Age                                0-17
Occupation                           10
City_Category                         A
Stay_In_Current_City_Years            2
Marital_Status                        0
Product_Category_1                    3
Product_Category_2                    6
Product_Category_3                   14
Purchase                           8370
Name: 0, dtype: object

In [26]:
# Select last row of dataframe

df1.iloc[-1]

User_ID                         1006039
Product_ID                    P00371644
Gender                                F
Age                               46-50
Occupation                            0
City_Category                         B
Stay_In_Current_City_Years           4+
Marital_Status                        1
Product_Category_1                   20
Product_Category_2                    2
Product_Category_3                   11
Purchase                            490
Name: 550067, dtype: object

### Columns selection using .iloc indexer

**select first column of dataframe**: 
df1.iloc[:,0]

**select second column of dataframe**: 
df1.iloc[:,1]

**select last column of dataframe**: 
df1.iloc[:,-1]

**select second last column of dataframe**: 
df1.iloc[:,-2]

### Indexing first occurrence of maximum or minimum values with idxmax() and idxmin()

Pandas provide two functions **idxmax()** and **idxmin()** that return index of first occurrence of maximum or minimum values over requested axis. NA/null values are excluded from the output.

In [27]:
# Get index of first occurence of maximum Purchase value 

df1['Purchase'].idxmax()

87440

In [28]:
# Get the row with the maximum Purchase value 

df1.loc[df1['Purchase'].idxmax()]

User_ID                         1001474
Product_ID                    P00052842
Gender                                M
Age                               26-35
Occupation                            4
City_Category                         A
Stay_In_Current_City_Years            2
Marital_Status                        1
Product_Category_1                   10
Product_Category_2                   15
Product_Category_3                    8
Purchase                          23961
Name: 87440, dtype: object

## Sorting

Pandas provides two kinds of sorting. They are:

* Sorting by label
* Sorting by actual value

### 1. Sorting by label

We can use the **sort_index()** method to sort the object by labels. DataFrame can be sorted by passing the axis arguments and the order of sorting. By default, sorting is done on row labels in ascending order.

In [29]:
# make a copy of dataframe df

df2 = df.copy()
df2.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,6.0,14.0,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,6.0,14.0,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,14.0,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,14.0,14.0,7969

In [30]:
# Sort the dataframe df2 by label

df2.sort_index()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,6.0,14.0,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,6.0,14.0,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,14.0,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,14.0,14.0,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,B,1,1,20,2.0,11.0,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,2.0,11.0,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,2.0,11.0,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,2.0,11.0,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,2.0,11.0,490

### Order of sorting

By passing the Boolean value to ascending parameter, the order of the sorting can be controlled.

**sort the dataframe df2 by label in reverse order**: 
df2.sort_index(ascending=False)

### Sorting by columns

By passing the axis argument with a value 0 or 1, the sorting can be done on the row or column labels.

The default value of axis=0. In this case, sorting can be done by rows.

If we set axis=1, sorting is done by columns.

**sort the dataframe df2 by columns**: 
df2.sort_index(axis=1)

### 2. Sorting by values

The second method of sorting is sorting by values. Pandas provides **sort_values()** method to sort by values. It accepts a 'by' argument which will use the column name of the DataFrame with which the values are to be sorted.

In [31]:
df2.sort_values(by=['Product_Category_1'])

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
271814,1005880,P00016042,M,26-35,1,A,1,1,1,16.0,8.0,8322
208659,1002109,P00298942,M,26-35,16,B,2,0,1,5.0,13.0,7823
436707,1001231,P00334242,M,26-35,12,C,1,0,1,8.0,17.0,15803
108508,1004685,P00025442,M,36-45,1,B,2,1,1,2.0,9.0,15647
208658,1002109,P00062842,M,26-35,16,B,2,0,1,2.0,13.0,11643
...,...,...,...,...,...,...,...,...,...,...,...,...
547638,1002549,P00375436,M,55+,13,C,3,1,20,2.0,11.0,613
547640,1002553,P00375436,M,26-35,7,C,0,0,20,2.0,11.0,240
547642,1002556,P00371644,M,26-35,4,C,2,0,20,2.0,11.0,120
547644,1002558,P00375436,M,55+,17,C,3,1,20,2.0,11.0,373
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,2.0,11.0,490

**Sort by multiple columns**: 
df2.sort_values(by=['Product_Category_1', 'Product_Category_2'])

**Sort in descending order**: 
df2.sort_values(by='Product_Category_1', ascending=False)

## Categorical data

In [32]:
# Check the data types of variables in the dataset

df3 = df.copy()

df3.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

We can see that our dataset has 5 categorical variables. They are **Product_ID**, **Gender, Age**, **City_Category** and **Stay_In_Current_City_Years**. They have data types as object.

Now, we will explore these categorical variables.

### Description of categorical data

The **describe()** method on categorical data will produce similar output to a Series or DataFrame of type string.

In [33]:
df3['Gender'].describe()

count     550068
unique         2
top            M
freq      414259
Name: Gender, dtype: object

The Gender category has 537577 counts, 2 unique values and frequency of top value M is 405380.

In [34]:
df3['Age'].describe()

count     550068
unique         7
top        26-35
freq      219587
Name: Age, dtype: object

There are 7 unique categories in Age variable. The most frequent category is 26-35 with frequency count of 214690.

### Unique values in categorical data

We can get the unique values in a series object by **unique()** method. It returns categories in the order of appearance, and it only includes values that are actually present.

In [35]:
df3['Gender'].unique()

array(['F', 'M'], dtype=object)

In [36]:
df3['Age'].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

#### Append new categories

Appending categories can be done by using the add_categories() method.

#### Remove categories

Removing categories can be done by using the remove_categories() method. Values which are removed are replaced by np.nan

#### Frequency counts of categorical data

Series methods like Series.value_counts() will return the frequency counts of the categories present in the series.

In [37]:
df3['Gender'].value_counts()

M    414259
F    135809
Name: Gender, dtype: int64

In [38]:
df3['City_Category'].value_counts()

B    231173
C    171175
A    147720
Name: City_Category, dtype: int64

## Pandas GroupBy operations

A groupby operation involves one of the following operations on the original object. They are as follows:

* Splitting the Object
* Applying a function
* Combining the results

#### Split Data into Groups

Pandas object can be split into any of their objects. There are multiple ways to split an object as follows :-

* obj.groupby('key')
* obj.groupby(['key1','key2'])
* obj.groupby(key,axis=1)

In [39]:
df4 = df.copy()

df4.groupby('Gender')

In [40]:
# View groups of Gender column

df4.groupby('Gender').groups

{'F': [0, 1, 2, 3, 14, 15, 16, 17, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 65, 66, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 124, 125, 126, 147, 148, 149, 150, 151, 156, 157, 158, 163, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 219, 222, 223, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 297, 298, 299, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 373, ...], 'M': [4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 67, 68, 69, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 152, 153, ...]}

In [41]:
# Group by with multiple columns

df4.groupby(['Gender', 'Age']).groups

{('F', '0-17'): [0, 1, 2, 3, 299, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 467, 468, 539, 540, 541, 542, 543, 617, 618, 619, 620, 621, 1150, 1151, 1304, 1305, 1306, 2905, 2907, 3010, 3715, 3804, 3805, 3806, 3807, 3808, 3835, 3836, 4551, 4552, 4553, 4554, 4555, 5453, 6431, 6759, 6760, 6761, 6762, 6763, 6764, 6765, 6766, 6767, 6768, 6769, 6770, 6771, 6772, 6773, 6774, 6775, 6776, 6777, 6778, 6779, 6780, 6781, 6782, 6783, 6784, 6785, 6786, 6787, 6788, 6789, 6790, 6791, 6792, 6793, 6794, 6795, 6796, 6797, 6798, 6799, 6800, 6801, 6802, 6803, 6804, 6805, 6806, 6807, 6808, ...], ('F', '18-25'): [70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 222, 223, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 547, 548, 549, 550, 625, 910, 911, 912, 913, 914, 1046, 1228, 1267, 1268, 1269, 1490, 1491, 1492, 1493, 1494, 1495, 1496, 1497, 1498, 1499, 1500, 1552, 1553, 1554, 1555, 1556, 1665, 1666, 1667, 1668, 1669, 1670, 1671, 1672, 1673, 1674, 1675, 1676, 1677, 1678, 1822, 1903, 1904, 1905, 1947, 1948, 1949, 1950, 1951, 1952, 1953, 1954, 1959, ...], ('F', '26-35'): [47, 48, 49, 124, 125, 126, 147, 148, 149, 150, 151, 163, 219, 297, 298, 406, 407, 454, 457, 458, 459, 460, 461, 529, 530, 585, 586, 691, 692, 693, 694, 695, 729, 730, 731, 732, 733, 734, 735, 736, 737, 738, 739, 740, 741, 742, 840, 841, 842, 843, 844, 845, 846, 847, 848, 849, 850, 851, 852, 853, 854, 855, 856, 857, 858, 859, 860, 861, 862, 863, 1033, 1034, 1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042, 1043, 1044, 1045, 1085, 1086, 1087, 1088, 1364, 1365, 1369, 1565, 1627, 1628, 1629, 1630, 1631, 1632, 1633, 1634, 1635, ...], ('F', '36-45'): [29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 65, 66, 156, 157, 158, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 531, 532, 533, 534, 535, 536, 537, 538, 566, 567, 568, 743, 744, 757, 758, 759, 760, 761, 762, 763, 764, 765, 766, 767, 768, 769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779, 780, 1187, 1188, 1189, 1190, 1191, 1229, 1230, 1231, 1232, 1233, 1652, 1653, 1741, 1770, 1771, 1772, 1773, 1774, 2197, 2198, 2199, 2200, 2201, 2202, 2203, ...], ('F', '46-50'): [248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 414, 415, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 472, 473, 474, 654, 655, 656, 657, 658, 717, 718, 719, 720, 721, 722, 723, 724, 725, 879, 880, 881, 895, 1078, 1079, 1080, 1081, 1082, 1083, 1084, 1095, 1096, 1097, 1098, 1099, 1100, 1101, 1102, 1103, 1104, 1105, 1106, 1107, 1108, 1109, 1110, 1111, 1112, 1113, 1114, 1115, 1141, 1142, 1143, 1144, 1145, 1146, 1147, 1148, 1149, 1434, 1435, 2549, 2550, 2551, 2552, 2553, 2554, 2555, 2556, 2557, 2558, 2559, 2560, 2561, 2562, 2563, 2564, 2565, 2566, ...], ('F', '51-55'): [14, 15, 16, 17, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 400, 401, 402, 997, 1467, 1468, 1469, 1470, 1471, 1472, 1473, 1474, 1475, 1476, 1477, 1478, 1479, 1480, 1957, 1958, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2026, 2027, 2028, 2782, 2783, 2784, 3526, 3527, 3528, 3650, 3651, 3652, 3653, 3654, 3993, 3994, 3995, 3996, 4177, 4178, 4179, 4180, 4755, 4901, 4902, 4903, 5625, 5626, 5630, 5631, 5632, 5633, 5884, 5885, 5886, 5887, 5888, 5889, ...], ('F', '55+'): [475, 476, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1981, 1982, 2139, 2140, 2141, 2142, 2227, 2228, 2229, 2230, 2231, 2232, 3123, 3124, 3125, 3126, 3127, 3128, 3129, 3130, 3131, 3132, 3133, 3134, 3655, 3656, 3657, 3658, 3659, 3660, 3687, 3688, 3689, 3690, 4693, 5444, 5445, 5446, 5447, 5448, 5449, 5450, 5451, 5452, 5594, 5595, 5596, 5597, 5732, 5733, 5734, 5735, 5736, 5737, 5738, 5739, 5740, 5741, 5742, 5743, 5744, 5745, 5765, 5766, 5767, 5768, 5769, 6077, 6078, 6404, 6405, 6406, 6407, 6408, 6409, 6931, 7780, 7781, 7782, 7783, 8223, ...], ('M', '0-17'): [85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 865, 866, 867, 2236, 2237, 2238, 2239, 2240, 2241, 2242, 2243, 2244, 2245, 2246, 2247, 2248, 2249, 2250, 2251, 3014, 3015, 3016, 3017, 3018, 3568, 3569, 3570, 3571, 4375, 4526, 4527, 4528, 4529, 4530, 4531, 4532, 4647, 4648, 4649, 4650, 4651, 4652, 4653, 4654, 4655, 4656, 4698, 4699, 4771, 5059, 5060, 5061, 5062, 5063, 5064, 5065, 5066, 5352, 5361, 5362, 5435, 5436, 5437, 5438, 5439, 5440, 5441, 5624, 5725, 5821, 5822, 5823, 5824, 5919, 5920, 5921, 5922, 5923, 5924, 5925, 6032, 6033, 6112, 6113, 6114, 6115, 6520, 6521, ...], ('M', '18-25'): [97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 127, 128, 129, 220, 221, 258, 259, 260, 261, 262, 263, 291, 292, 293, 294, 295, 296, 300, 301, 302, 303, 339, 340, 341, 388, 389, 390, 391, 392, 403, 404, 405, 408, 409, 416, 417, 418, 419, 420, 438, 439, 440, 462, 463, 464, 465, 466, 583, 584, 652, 653, 676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 700, 701, 702, 703, 704, 705, 706, 707, 708, 709, 710, 711, 712, 713, 714, 715, 716, 726, 727, 728, 750, 751, 752, 753, ...], ('M', '26-35'): [5, 9, 10, 11, 12, 13, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 50, 51, 56, 57, 58, 59, 60, 61, 62, 63, 64, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, ...], ('M', '36-45'): [18, 55, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 152, 153, 154, 155, 335, 336, 337, 338, 393, 394, 395, 396, 397, 398, 421, 422, 433, 434, 435, 436, 437, 491, 492, 493, 494, 544, 545, 546, 551, 552, 553, 554, 555, 556, 557, 580, 581, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615, 616, 623, 624, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636, 637, 638, 639, 640, 641, 642, 643, 644, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675, 830, 831, 832, 833, 834, ...], ('M', '46-50'): [6, 7, 8, 52, 53, 54, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 189, 190, 191, 192, 193, 194, 195, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 527, 528, 558, 559, 560, 561, 562, 563, 564, 565, 569, 570, 571, 572, 573, 574, 576, 577, 578, 646, 647, 648, 649, 650, 651, 898, 899, 900, 901, 902, 903, 904, 905, 906, 907, 908, 909, 1057, 1058, 1089, 1090, 1091, 1307, 1308, 1309, 1323, 1324, 1325, 1326, 1327, 1328, 1329, 1330, 1331, 1332, 1333, 1334, 1335, 1336, ...], ('M', '51-55'): [67, 68, 69, 333, 334, 370, 371, 788, 789, 790, 791, 792, 793, 794, 795, 796, 797, 798, 799, 800, 801, 802, 803, 804, 805, 806, 807, 868, 869, 870, 871, 1047, 1048, 1049, 1050, 1486, 1487, 1488, 1489, 1503, 1504, 1505, 1506, 1681, 1682, 1683, 1738, 1739, 1740, 1775, 1776, 1777, 1778, 1779, 1780, 1781, 1782, 1815, 1816, 1817, 1818, 1819, 1915, 1916, 1917, 1918, 1919, 1920, 1921, 1922, 2029, 2030, 2031, 2032, 2033, 2034, 2035, 2036, 2037, 2038, 2039, 2040, 2041, 2042, 2043, 2044, 2045, 2046, 2047, 2048, 2049, 2050, 2051, 2052, 2053, 2054, 2055, 2056, 2124, 2175, ...], ('M', '55+'): [4, 159, 160, 161, 162, 451, 452, 453, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 645, 659, 893, 894, 1051, 1052, 1053, 1054, 1116, 1117, 1118, 1119, 1559, 1560, 1792, 1793, 1794, 1795, 1796, 1797, 1798, 1799, 1800, 1801, 1802, 1803, 1804, 1805, 1806, 1978, 1979, 1980, 2016, 2017, 2018, 2096, 2097, 2322, 2510, 2614, 2615, 2766, 2767, 2768, 2769, 2770, 2771, 2793, 2794, 2795, 2796, 2797, 2798, 2799, 3011, 3478, 3837, 3838, 3839, 3840, 3841, 3842, 3843, 3844, 3845, 4175, 4176, 4423, 4424, 4425, 4426, 4694, 4695, 4696, 5052, 5053, 5083, 5084, ...]}

### Aggregation functions with groupby

An aggregation function returns a single aggregated value for each group. Once the group by object is created, several aggregation operations can be performed on the grouped data as follows:

In [42]:
# Apply aggregation function sum with groupby

df4.groupby('Gender').sum()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
Gender,,,,,,,
F,136234060927,915426,56988,776517,1356094.0,1701913.0,1186232642
M,415500008355,3527312,168349,2196199,4069331.0,5256845.0,3909580100

In [43]:
# Alternative way to apply aggregation function sum

df4.groupby('Gender').agg(np.sum)

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
Gender,,,,,,,
F,136234060927,915426,56988,776517,1356094.0,1701913.0,1186232642
M,415500008355,3527312,168349,2196199,4069331.0,5256845.0,3909580100

### Applying multiple aggregation functions at once

With grouped Series, you can also pass a list or dict of functions to do aggregation with, and generate DataFrame as output as follows:

In [44]:
df4.groupby('Gender')['Purchase'].agg([np.sum, np.mean])

               sum         mean
Gender
F       1186232642  8734.565765
M       3909580100  9437.526040

### Transformations

Transformation on a group or a column returns an object that is indexed the same size of that is being grouped. Thus, the transform should return a result that is the same size as that of a group chunk.

In [45]:
df5 = df.copy()


score = lambda x: (x - x.mean()) / x.std()*10


print(df5.groupby('Gender')['Purchase'].transform(score).head(5))

0    -0.764732
1    13.562236
2   -15.339224
3   -16.104867
4    -2.883881
Name: Purchase, dtype: float64

### Filtration

Filtration filters the data on a defined criteria and returns the subset of data. The **filter()** function is used to filter the data.

In [46]:
df6 = df.copy()

df6.groupby('Gender').filter(lambda x: len(x) > 4)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,6.0,14.0,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,6.0,14.0,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,14.0,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,14.0,14.0,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,B,1,1,20,2.0,11.0,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,2.0,11.0,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,2.0,11.0,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,2.0,11.0,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,2.0,11.0,490

## Pandas Merging and Joining

Pandas provides a single function, merge, as the entry point for all standard database join operations between DataFrame objects.

The syntax of the merge function is as follows:

pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=True)

The description of the parameters used is as follows−

* **left** − A DataFrame object.
* **right** − Another DataFrame object.
* **on** − Columns (names) to join on. Must be found in both the left and right DataFrame objects.
* **left_on** − Columns from the left DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame.
* **right_on** − Columns from the right DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame.
* **left_index** − If True, use the index (row labels) from the left DataFrame as its join key(s). In case of a DataFrame with a MultiIndex (hierarchical), the number of levels must match the number of join keys from the right DataFrame.
* **right_index** − Same usage as left_index for the right DataFrame.
* **how** − One of 'left', 'right', 'outer', 'inner'. Defaults to inner.
* **sort** − Sort the result DataFrame by the join keys in lexicographical order. Defaults to True, setting to False will improve the performance substantially in many cases.

Now, we will create two different DataFrames and perform the merging operations on them as follows:

In [47]:
# Let's create two dataframes

batsmen = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Rohit', 'Dhawan', 'Virat', 'Dhoni', 'Kedar'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})

bowler = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Kumar', 'Bumrah', 'Shami', 'Kuldeep', 'Chahal'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})


print(batsmen)


print(bowler)

   id    Name subject_id
0   1   Rohit       sub1
1   2  Dhawan       sub2
2   3   Virat       sub4
3   4   Dhoni       sub6
4   5   Kedar       sub5
   id     Name subject_id
0   1    Kumar       sub2
1   2   Bumrah       sub4
2   3    Shami       sub3
3   4  Kuldeep       sub6
4   5   Chahal       sub5

In [48]:
# Merge two dataframes on a key

pd.merge(batsmen, bowler, on='id')

   id  Name_x subject_id_x   Name_y subject_id_y
0   1   Rohit         sub1    Kumar         sub2
1   2  Dhawan         sub2   Bumrah         sub4
2   3   Virat         sub4    Shami         sub3
3   4   Dhoni         sub6  Kuldeep         sub6
4   5   Kedar         sub5   Chahal         sub5

In [49]:
# Merge two dataframes on multiple keys

pd.merge(batsmen, bowler, on=['id', 'subject_id'])

   id Name_x subject_id   Name_y
0   4  Dhoni       sub6  Kuldeep
1   5  Kedar       sub5   Chahal

### Merge using 'how' argument

The **how** argument to merge specifies how to determine which keys are to be included in the resulting table. If a key combination does not appear in either the left or the right tables, the values in the joined table will be **NA**.

Here is a summary of the how options and their SQL equivalent names −

Merge Method - SQL Equivalent - Description
* left - LEFT OUTER JOIN - Use keys from left object
* right - RIGHT OUTER JOIN - Use keys from right object
* outer - FULL OUTER JOIN - Use union of keys
* inner - INNER JOIN - Use intersection of keys

In [50]:
# Left join

pd.merge(batsmen, bowler, on='subject_id', how='left')

   id_x  Name_x subject_id  id_y   Name_y
0     1   Rohit       sub1   NaN      NaN
1     2  Dhawan       sub2   1.0    Kumar
2     3   Virat       sub4   2.0   Bumrah
3     4   Dhoni       sub6   4.0  Kuldeep
4     5   Kedar       sub5   5.0   Chahal

In [51]:
# Right join

pd.merge(batsmen, bowler, on='subject_id', how='right')

   id_x  Name_x subject_id  id_y   Name_y
0   2.0  Dhawan       sub2     1    Kumar
1   3.0   Virat       sub4     2   Bumrah
2   NaN     NaN       sub3     3    Shami
3   4.0   Dhoni       sub6     4  Kuldeep
4   5.0   Kedar       sub5     5   Chahal

In [52]:
# Outer join

pd.merge(batsmen, bowler, on='subject_id', how='outer')

   id_x  Name_x subject_id  id_y   Name_y
0   1.0   Rohit       sub1   NaN      NaN
1   2.0  Dhawan       sub2   1.0    Kumar
2   3.0   Virat       sub4   2.0   Bumrah
3   4.0   Dhoni       sub6   4.0  Kuldeep
4   5.0   Kedar       sub5   5.0   Chahal
5   NaN     NaN       sub3   3.0    Shami

In [53]:
# Inner join

pd.merge(batsmen, bowler, on='subject_id', how='inner')

   id_x  Name_x subject_id  id_y   Name_y
0     2  Dhawan       sub2     1    Kumar
1     3   Virat       sub4     2   Bumrah
2     4   Dhoni       sub6     4  Kuldeep
3     5   Kedar       sub5     5   Chahal